Ejercicio_6/code4/app/Controllers/Personas.php

    public function index()
    {
        $persona = new Persona();
        $datos['personas'] = $persona->orderBy('ci', 'ASC')->findAll();
---
SELECT *
FROM `PERSONA`
ORDER BY `ci` ASC

    public function editar($ci = null)
    {
        $persona = new Persona();

        $datos['persona'] = $persona->where('ci', $ci)->first();
---
SELECT *
FROM `PERSONA`
WHERE `ci` = '12353454'
 LIMIT 1

                'telefono' => $telefono,
                'departamento' => $dep];

        $persona->update($ci, $datos);
---
UPDATE `PERSONA` SET `nombre_completo` = 'Victor Andrade', `fecha_nacimiento` = '2002-03-10', `telefono` = '+591 60643003', `departamento` = '04'
WHERE `PERSONA`.`ci` IN ('23125353')